# Revit Semantic Schema Mapper - Run Summary

## 1. Crawl scope
- Revit version: 2025
- Namespace: Autodesk.Revit.DB

## 2. Pages discovered
- 26624

## 3. Pages parsed
- 23168

## 4. Node candidates
- 2460

## 5. Property relationship candidates
- 8148

## 6. Method relationship candidates
- 2783

## 7. Enum members extracted
- 8424

## 8. Top 25 highest-confidence candidate edges
- `Autodesk.Revit.DB.AreaTag.AreaTagType` -> **TAGS_ELEMENT** -> `Autodesk.Revit.DB.AreaTagType` (`direct_return_type`; return type `AreaTagType`)
- `Autodesk.Revit.DB.AssemblyCodeTable.GetAssemblyCodeTable` -> **MEMBER_OF_ASSEMBLY** -> `Autodesk.Revit.DB.AssemblyCodeTable` (`direct_return_type`; return type `AssemblyCodeTable`)
- `Autodesk.Revit.DB.AssemblyInstance.CompareAssemblyInstances` -> **MEMBER_OF_ASSEMBLY** -> `Autodesk.Revit.DB.AssemblyDifference` (`direct_return_type`; return type `AssemblyDifference`)
- `Autodesk.Revit.DB.AssemblyViewUtils.CreateMaterialTakeoff` -> **USES_MATERIAL** -> `Autodesk.Revit.DB.ViewSchedule` (`direct_return_type`; return type `ViewSchedule`)
- `Autodesk.Revit.DB.AssemblyViewUtils.CreateMaterialTakeoff` -> **USES_MATERIAL** -> `Autodesk.Revit.DB.ViewSchedule` (`direct_return_type`; return type `ViewSchedule`)
- `Autodesk.Revit.DB.AssemblyViewUtils.CreateSheet` -> **PLACED_ON_SHEET** -> `Autodesk.Revit.DB.ViewSheet` (`direct_return_type`; return type `ViewSheet`)
- `Autodesk.Revit.DB.AssemblyViewUtils.CreateSingleCategorySchedule` -> **HAS_CATEGORY** -> `Autodesk.Revit.DB.ViewSchedule` (`direct_return_type`; return type `ViewSchedule`)
- `Autodesk.Revit.DB.AssemblyViewUtils.CreateSingleCategorySchedule` -> **HAS_CATEGORY** -> `Autodesk.Revit.DB.ViewSchedule` (`direct_return_type`; return type `ViewSchedule`)
- `Autodesk.Revit.DB.BeamSystem.Level` -> **ASSIGNED_TO_LEVEL** -> `Autodesk.Revit.DB.Level` (`direct_return_type`; return type `Level`)
- `Autodesk.Revit.DB.BrowserOrganization.GetCurrentBrowserOrganizationForSheets` -> **PLACED_ON_SHEET** -> `Autodesk.Revit.DB.BrowserOrganization` (`direct_return_type`; return type `BrowserOrganization`)
- `Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.HighestAssociatedLevelBelowLowestAssociatedLevel` -> **ASSIGNED_TO_LEVEL** -> `Autodesk.Revit.DB.FailureDefinitionId` (`direct_return_type`; return type `FailureDefinitionId`)
- `Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.LowestAssociatedLevelAboveHighestAssociatedLevel` -> **ASSIGNED_TO_LEVEL** -> `Autodesk.Revit.DB.FailureDefinitionId` (`direct_return_type`; return type `FailureDefinitionId`)
- `Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.CannotCreateArraySelectionIsGrouped` -> **MEMBER_OF_GROUP** -> `Autodesk.Revit.DB.FailureDefinitionId` (`direct_return_type`; return type `FailureDefinitionId`)
- `Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.CouldntFindNewHostsForElements` -> **HOSTED_BY** -> `Autodesk.Revit.DB.FailureDefinitionId` (`direct_return_type`; return type `FailureDefinitionId`)
- `Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AddedElementsNotSamePhaseAsAssembly` -> **ASSIGNED_TO_PHASE** -> `Autodesk.Revit.DB.FailureDefinitionId` (`direct_return_type`; return type `FailureDefinitionId`)
- `Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyDeleteTypeWarn` -> **MEMBER_OF_ASSEMBLY** -> `Autodesk.Revit.DB.FailureDefinitionId` (`direct_return_type`; return type `FailureDefinitionId`)
- `Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyDidNotMatchRequestedTypeWarn` -> **MEMBER_OF_ASSEMBLY** -> `Autodesk.Revit.DB.FailureDefinitionId` (`direct_return_type`; return type `FailureDefinitionId`)
- `Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyDisassembleInstanceWarn` -> **MEMBER_OF_ASSEMBLY** -> `Autodesk.Revit.DB.FailureDefinitionId` (`direct_return_type`; return type `FailureDefinitionId`)
- `Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyInheritTypeWarn` -> **MEMBER_OF_ASSEMBLY** -> `Autodesk.Revit.DB.FailureDefinitionId` (`direct_return_type`; return type `FailureDefinitionId`)
- `Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyInvalidMember` -> **MEMBER_OF_ASSEMBLY** -> `Autodesk.Revit.DB.FailureDefinitionId` (`direct_return_type`; return type `FailureDefinitionId`)
- `Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyNewTypeWarn` -> **MEMBER_OF_ASSEMBLY** -> `Autodesk.Revit.DB.FailureDefinitionId` (`direct_return_type`; return type `FailureDefinitionId`)
- `Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AssemblyRenameTypeWarn` -> **MEMBER_OF_ASSEMBLY** -> `Autodesk.Revit.DB.FailureDefinitionId` (`direct_return_type`; return type `FailureDefinitionId`)
- `Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.CouldNotAcquireAssemblyViews` -> **MEMBER_OF_ASSEMBLY** -> `Autodesk.Revit.DB.FailureDefinitionId` (`direct_return_type`; return type `FailureDefinitionId`)
- `Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.CouldNotChangeTypeOfAssembly` -> **MEMBER_OF_ASSEMBLY** -> `Autodesk.Revit.DB.FailureDefinitionId` (`direct_return_type`; return type `FailureDefinitionId`)
- `Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.DeleteAssemblyInstWithViewsWarn` -> **MEMBER_OF_ASSEMBLY** -> `Autodesk.Revit.DB.FailureDefinitionId` (`direct_return_type`; return type `FailureDefinitionId`)

## 9. Top 25 uncertain candidates needing review
- `Autodesk.Revit.DB.AlphanumericRevisionSettings.GetSequence` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.string` (`needs_runtime_validation`; return type `IList < string >`)
- `Autodesk.Revit.DB.AnnotationMultipleAlignmentUtils.GetAnnotationOutlineWithoutLeaders` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.XYZ` (`needs_runtime_validation`; return type `IList < XYZ >`)
- `Autodesk.Revit.DB.AnnotationSymbol.GetLeaders` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.Leader` (`needs_runtime_validation`; return type `IList < Leader >`)
- `Autodesk.Revit.DB.BaseExportOptions.GetPredefinedSetupNames` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.string` (`needs_runtime_validation`; return type `IList < string >`)
- `Autodesk.Revit.DB.BaseImportOptions.GetLayerSelection` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.string` (`needs_runtime_validation`; return type `ICollection < string >`)
- `Autodesk.Revit.DB.BrowserOrganization.GetFolderItems` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.FolderItemInfo` (`needs_runtime_validation`; return type `IList < FolderItemInfo >`)
- `Autodesk.Revit.DB.ColorFillLegend.GetColumnWidths` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.double` (`needs_runtime_validation`; return type `IList < double >`)
- `Autodesk.Revit.DB.ColorFillScheme.GetEntries` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.ColorFillSchemeEntry` (`needs_runtime_validation`; return type `IList < ColorFillSchemeEntry >`)
- `Autodesk.Revit.DB.ComponentRepeater.RepeatElements` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.ComponentRepeater` (`needs_runtime_validation`; return type `IList < ComponentRepeater >`)
- `Autodesk.Revit.DB.CompoundStructure.GetAdjacentRegions` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.int` (`needs_runtime_validation`; return type `IList < int >`)
- `Autodesk.Revit.DB.CompoundStructure.GetExtendableRegionIds` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.int` (`needs_runtime_validation`; return type `IList < int >`)
- `Autodesk.Revit.DB.CompoundStructure.GetLayers` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.CompoundStructureLayer` (`needs_runtime_validation`; return type `IList < CompoundStructureLayer >`)
- `Autodesk.Revit.DB.CompoundStructure.GetRegionIds` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.int` (`needs_runtime_validation`; return type `IList < int >`)
- `Autodesk.Revit.DB.CompoundStructure.GetRegionsAlongLevel` -> **ASSIGNED_TO_LEVEL** -> `Autodesk.Revit.DB.int` (`needs_runtime_validation`; return type `IList < int >`)
- `Autodesk.Revit.DB.CompoundStructure.GetRegionsAssociatedToLayer` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.int` (`needs_runtime_validation`; return type `IList < int >`)
- `Autodesk.Revit.DB.CompoundStructure.GetSegmentIds` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.int` (`needs_runtime_validation`; return type `IList < int >`)
- `Autodesk.Revit.DB.CompoundStructure.GetWallSweepsInfo` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.WallSweepInfo` (`needs_runtime_validation`; return type `IList < WallSweepInfo >`)
- `Autodesk.Revit.DB.ContourSetting.GetContourSettingItems` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.ContourSettingItem` (`needs_runtime_validation`; return type `IList < ContourSettingItem >`)
- `Autodesk.Revit.DB.CurtainGrid.GetCurtainCells` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.CurtainCell` (`needs_runtime_validation`; return type `ICollection < CurtainCell >`)
- `Autodesk.Revit.DB.Curve.Tessellate` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.XYZ` (`needs_runtime_validation`; return type `IList < XYZ >`)
- `Autodesk.Revit.DB.CurveByPointsUtils.GetFaceRegions` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.Reference` (`needs_runtime_validation`; return type `IList < Reference >`)
- `Autodesk.Revit.DB.CurveElement.CreateAreaBasedLoadBoundaryLines` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.CurveElement` (`needs_runtime_validation`; return type `IList < CurveElement >`)
- `Autodesk.Revit.DB.CurveUV.ComputeDerivatives` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.UV` (`needs_runtime_validation`; return type `IList < UV >`)
- `Autodesk.Revit.DB.DatumPlane.GetCurvesInView` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.Curve` (`needs_runtime_validation`; return type `IList < Curve >`)
- `Autodesk.Revit.DB.DGNExportOptions.GetPredefinedSetupNames` -> **UNKNOWN_DB_OBJECT_REFERENCE** -> `Autodesk.Revit.DB.string` (`needs_runtime_validation`; return type `IList < string >`)

## 10. Unknown-reference target type breakdown
Both UNKNOWN_* edge types mean 'definitely a reference, but no keyword/docs evidence identifies which specific relationship' -- per docs/edge_taxonomy_v0.md, that's the conservative, honest label, not a bug to fix by guessing a specific type. This breakdown exists so a concentration in a few target types (e.g. a generic identifier type referenced from all over the API) is visible here instead of only discoverable by querying candidate_edges.json directly.
- 8694 total UNKNOWN_* edges, 801 distinct target type(s)
  - `Autodesk.Revit.DB.ForgeTypeId`: 4087 (47%)
  - `Autodesk.Revit.DB.FailureDefinitionId`: 2090 (24%)
  - `(none)`: 378 (4%)
  - `Autodesk.Revit.DB.Curve`: 65 (1%)
  - `Autodesk.Revit.DB.Color`: 52 (1%)
  - `Autodesk.Revit.DB.ExternalServiceId`: 51 (1%)
  - `Autodesk.Revit.DB.Transform`: 49 (1%)
  - `Autodesk.Revit.DB.Reference`: 48 (1%)
  - `Autodesk.Revit.DB.CurveLoop`: 35 (0%)
  - `Autodesk.Revit.DB.XYZ`: 33 (0%)
  - `Autodesk.Revit.DB.FilterRule`: 32 (0%)
  - `Autodesk.Revit.DB.IFCAnyHandle`: 26 (0%)
  - `Autodesk.Revit.DB.string`: 23 (0%)
  - `Autodesk.Revit.DB.Solid`: 22 (0%)
  - `Autodesk.Revit.DB.Element`: 22 (0%)
  - ...and 786 more target type(s)

## 11. Limitations
- Edge classification is a static, docs-only heuristic; no candidate edge has been validated against a live Revit document (see confidence label needs_runtime_validation).
- Member pages reachable only via a type's members table are discovered incrementally during parsing; a partial/interrupted crawl can under-count members for the last few types processed.
- Name-keyword-to-edge-type mapping (classify.py) is heuristic and English-name-based; it will misclassify or under-classify members whose names don't match the documented keyword list.
- 96 page(s) failed to fetch or parse: ['https://www.revitapidocs.com/2025/93d26466-11de-842c-f089-6b15b839e6af.htm', 'https://www.revitapidocs.com/2025/8f200255-a515-0c02-656b-b241e0011228.htm', 'https://www.revitapidocs.com/2025/8d74cf02-9271-3c6c-00f5-bc7b48d52c56.htm', 'https://www.revitapidocs.com/2025/77aa9939-8f41-1725-80dc-864ca1f7a49c.htm', 'https://www.revitapidocs.com/2025/2f482b62-410e-2db9-b6b9-c64abedcbc4c.htm', 'https://www.revitapidocs.com/2025/7ace570d-870f-be20-e493-e80ffa27f454.htm', 'https://www.revitapidocs.com/2025/26a118b5-c583-a9b2-c935-c11b270e140e.htm', 'https://www.revitapidocs.com/2025/e46e0d8f-5bcb-46bf-5def-03af68327b9e.htm', 'https://www.revitapidocs.com/2025/ace39293-a976-d22b-4798-42bb8e82b307.htm', 'https://www.revitapidocs.com/2025/941de0b6-a0f9-eb5a-5f25-9aa4d9da699a.htm'] ...

## 12. Recommended next steps
- Run against a live revitapidocs.com session and diff parser_notes across all pages to find and fix selector assumptions that didn't hold (see docs/crawl_notes.md).
- Expand the name-keyword edge taxonomy with additional evidence gathered from real docs text (docs_semantic_hint) rather than name matching alone.
- Cross-check high-confidence candidate edges (direct_return_type, elementid_with_strong_name) against a small number of real Revit documents to promote them out of 'candidate' status.
- Extend to Autodesk.Revit.DB.Architecture and Autodesk.Revit.DB.Structure for Room/Space and structural element coverage once the core DB namespace is validated.

## 13. Knowledge graph materialization

`graph.json`/`graph_core.json` resolve each edge's `candidate_target_type` string against the crawled node set (see graph.py) instead of leaving it as a loose type name.
- 2465 total nodes (5 external -- referenced by an edge but never crawled/classified)
- 10931 total edges
- Target resolution: exact=9199, external=71, none=994, short_name_fallback=667
- Confidence tier breakdown: core=1310, likely=663, needs_validation=381, unverified_reference=8577
- `graph_core.json` (confidence_tier=core only): 312 nodes, 1216 edges
- 56 communities detected over the core subgraph (heuristic=56 labels)
- Largest communities:
  - `FailureDefinitionId · BuiltInFailures.GroupFailures · BuiltInFailures.FamilyFailures` (73 nodes)
  - `Category · ConceptualSurfaceType · ConceptualConstructionType` (26 nodes)
  - `Document · BindingMap · DuplicateTypeNamesHandlerArgs` (20 nodes)
  - `Material · MassSurfaceData · EnergyAnalysisConstruction` (19 nodes)
  - `Level · MultistoryStairs · AreaBasedLoadBoundaryLineData` (16 nodes)
  - `ViewSheet · FabricArea · FabricSheetType` (8 nodes)
  - `ForgeTypeId · ParameterTypeId · InternalDefinition` (8 nodes)
  - `Reference · RebarConstraint · DividedSurface` (7 nodes)
  - `Phase · EnergyDataSettings · PlanTopology` (6 nodes)
  - `Element · Parameter · ChangeType` (6 nodes)